app/Models/ModelPenjualan.php

SELECT *
FROM `tbl_produk`
JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori`=`tbl_produk`.`id_kategori`
JOIN `tbl_satuan` ON `tbl_satuan`.`id_satuan`=`tbl_produk`.`id_satuan`
WHERE `kode_produk` = '11111'
---
    public function CekProduk($kode_produk)
    {
         return $this->db->table('tbl_produk')
         ->join('tbl_kategori', 'tbl_kategori.id_kategori=tbl_produk.id_kategori')
         ->join('tbl_satuan', 'tbl_satuan.id_satuan=tbl_produk.id_satuan')
         ->where('kode_produk', $kode_produk)
         ->get()
         ->getRowArray();

SELECT *
FROM `tbl_produk`
JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori`=`tbl_produk`.`id_kategori`
JOIN `tbl_satuan` ON `tbl_satuan`.`id_satuan`=`tbl_produk`.`id_satuan`
WHERE `stok` >0
---
    public function AllProduk()
    {
         return $this->db->table('tbl_produk')
         ->join('tbl_kategori', 'tbl_kategori.id_kategori=tbl_produk.id_kategori')
         ->join('tbl_satuan', 'tbl_satuan.id_satuan=tbl_produk.id_satuan')
         ->where('stok > 0')
         ->get()
         ->getResultArray();

INSERT INTO `tbl_jual` (`no_faktur`, `tgl_jual`, `jam`, `grand_total`, `dibayar`, `kembalian`, `id_user`) VALUES ('202401070004', '2024-01-07', '19:10:37', 60000, '100000', '40000', '1')
---
    public function InsertJual($data)
    {
        $this->db->table('tbl_jual')->insert($data);

INSERT INTO `tbl_rinci_jual` (`no_faktur`, `kode_produk`, `harga`, `modal`, `qty`, `total_harga`, `untung`) VALUES ('202401070004', '11111', 60000, '50000', 1, 60000, 10000)
---
    public function InsertRinciJual($data)
    {
        $this->db->table('tbl_rinci_jual')->insert($data);