app/Models/ModelProduk.php

    public function AllData()
    {
         return $this->db->table('tbl_produk')
         ->join('tbl_kategori', 'tbl_kategori.id_kategori=tbl_produk.id_kategori')
         ->join('tbl_satuan', 'tbl_satuan.id_satuan=tbl_produk.id_satuan')
         ->orderBy('id_produk', 'DESC')
         ->get()
         ->getResultArray();
---
SELECT *
FROM `tbl_produk`
JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori`=`tbl_produk`.`id_kategori`
JOIN `tbl_satuan` ON `tbl_satuan`.`id_satuan`=`tbl_produk`.`id_satuan`
ORDER BY `id_produk` DESC

    public function InsertData($data)
    {
       $this->db->table('tbl_produk')->insert($data);
---
INSERT INTO `tbl_produk` (`kode_produk`, `nama_produk`, `id_kategori`, `id_satuan`, `harga_beli`, `harga_jual`, `stok`) VALUES ('11111', 'Wardah', '1', '4', '50000', '100000', '100')

    public function DeleteData($data)
    {
       $this->db->table('tbl_produk')
       ->where('id_produk' ,$data['id_produk'])
       ->delete($data);
---
DELETE FROM `tbl_produk`
WHERE `id_produk` = '6'
AND `id_produk` = '6'