app/Models/ModelLaporan.php

   public function DataBulanan($bulan, $tahun)
   {
        return $this->db->table('tbl_rinci_jual')
            ->join('tbl_jual', 'tbl_jual.no_faktur=tbl_rinci_jual.no_faktur')
            ->where('month(tbl_jual.tgl_jual)', $bulan)
            ->where('year(tbl_jual.tgl_jual)', $tahun)
            ->select('tbl_jual.tgl_jual')
            ->groupBy('tbl_jual.tgl_jual')
            ->selectSum('tbl_rinci_jual.total_harga')
            ->selectSum('tbl_rinci_jual.untung')
            ->get()->getResultArray();
---
SELECT `tbl_jual`.`tgl_jual`, SUM(`tbl_rinci_jual`.`total_harga`) AS `total_harga`, SUM(`tbl_rinci_jual`.`untung`) AS `untung`
FROM `tbl_rinci_jual`
JOIN `tbl_jual` ON `tbl_jual`.`no_faktur`=`tbl_rinci_jual`.`no_faktur`
WHERE month(tbl_jual.tgl_jual) = '1'
AND year(tbl_jual.tgl_jual) = '2024'
GROUP BY `tbl_jual`.`tgl_jual`

   public function DataTahunan($tahun)
   {
        return $this->db->table('tbl_rinci_jual')
            ->join('tbl_jual', 'tbl_jual.no_faktur=tbl_rinci_jual.no_faktur')
            ->where('year(tbl_jual.tgl_jual)', $tahun)
            ->select('month(tbl_jual.tgl_jual) as bulan')
            ->groupBy('month(tbl_jual.tgl_jual)')
            ->selectSum('tbl_rinci_jual.total_harga')
            ->selectSum('tbl_rinci_jual.untung')
            ->get()->getResultArray();
---
SELECT month(tbl_jual.tgl_jual) as bulan, SUM(`tbl_rinci_jual`.`total_harga`) AS `total_harga`, SUM(`tbl_rinci_jual`.`untung`) AS `untung`
FROM `tbl_rinci_jual`
JOIN `tbl_jual` ON `tbl_jual`.`no_faktur`=`tbl_rinci_jual`.`no_faktur`
WHERE year(tbl_jual.tgl_jual) = '2024'
GROUP BY month(tbl_jual.tgl_jual)