app/Models/ModelSatuan.php

   public function AllData()
   {
        return $this->db->table('tbl_satuan')
        ->get()
        ->getResultArray();
---
SELECT *
FROM `tbl_satuan`

   public function InsertData($data)
   {
      $this->db->table('tbl_satuan')->insert($data);
---
INSERT INTO `tbl_satuan` (`nama_satuan`) VALUES ('BKS')

   public function DeleteData($data)
   {
      $this->db->table('tbl_satuan')
      ->where('id_satuan' ,$data['id_satuan'])
      ->delete($data);
---
DELETE FROM `tbl_satuan`
WHERE `id_satuan` = '2'
AND `id_satuan` = '2'